{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "Cast", 
      "name": "cast0", 
      "attr": {"dtype": "float32"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attr": {
        "kernel": "(8, 8)", 
        "num_filter": "16", 
        "stride": "(4, 4)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias", 
      "attr": {
        "kernel": "(8, 8)", 
        "num_filter": "16", 
        "stride": "(4, 4)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attr": {
        "kernel": "(8, 8)", 
        "num_filter": "16", 
        "stride": "(4, 4)"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_weight", 
      "attr": {
        "kernel": "(4, 4)", 
        "num_filter": "32", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_bias", 
      "attr": {
        "kernel": "(4, 4)", 
        "num_filter": "32", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2", 
      "attr": {
        "kernel": "(4, 4)", 
        "num_filter": "32", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten0", 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc4_weight", 
      "attr": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc4_bias", 
      "attr": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc4", 
      "attr": {"num_hidden": "256"}, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc_policy_weight", 
      "attr": {"num_hidden": "2"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_policy_bias", 
      "attr": {"num_hidden": "2"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc_policy", 
      "attr": {"num_hidden": "2"}, 
      "inputs": [[14, 0, 0], [15, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "policy", 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "policy_out", 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc_value_weight", 
      "attr": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_value_bias", 
      "attr": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc_value", 
      "attr": {"num_hidden": "1"}, 
      "inputs": [[14, 0, 0], [20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "value_out", 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "clip0", 
      "attr": {
        "a_max": "1.0", 
        "a_min": "1e-20"
      }, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "log", 
      "name": "log0", 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "actionInput", 
      "inputs": []
    }, 
    {
      "op": "_mul", 
      "name": "_mul1", 
      "inputs": [[25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum1", 
      "attr": {"axis": "1"}, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "tdInput", 
      "inputs": []
    }, 
    {
      "op": "sum", 
      "name": "sum2", 
      "attr": {"axis": "1"}, 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul2", 
      "inputs": [[28, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul0", 
      "inputs": [[18, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum0", 
      "attr": {"axis": "1"}, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar0", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar1", 
      "attr": {"scalar": "0.01"}, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[31, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum3", 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar2", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "rewardInput", 
      "inputs": []
    }, 
    {
      "op": "_sub", 
      "name": "_minus0", 
      "inputs": [[39, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square0", 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum4", 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3", 
      "attr": {"scalar": "0.5"}, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[38, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "makeloss0", 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar4", 
      "attr": {"scalar": "0.5"}, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[38, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad0", 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "policy_out2", 
      "inputs": [[17, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    3, 
    6, 
    7, 
    11, 
    12, 
    15, 
    16, 
    20, 
    21, 
    26, 
    29, 
    39
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50
  ], 
  "heads": [[19, 0, 0], [23, 0, 0], [45, 0, 0], [48, 0, 0], [49, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 904]}
}